Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: སྐྱེ་བ་མེད་པའི་ཕྱིར་མི་སྐྱེ་བའོ། །འགག་པ་མེད་པའི་ཕྱིར་མི་འགག་པའོ། །གོས་པ་མེད་པའི་ཕྱིར་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའོ། །རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་ཕྱིར་རྣམ་པར་བྱང་བ་མེད་པའོ། །རྣམ་པར་དག་པའི་རྒྱུར་མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་ཕྱིར།
en: It is nonproduction because it does not arise; it is nonstopping because it does not stop; it is nondefilement because it is not stained; it is nonpurification because it is naturally pure; and it is not occasioning anything because the occasioning of anything that causes purification does not exist.

source: །ད་ནི་ཐེག་པ་གང་དུ་གནས་པར་འགྱུར་ཞེས་བྱ་བ་ནི་ཞུས་པ་བཞི་པ་བརྩམས་ཏེ།
en: Where will that Great Vehicle stand? Now, taking the fourth question—“Where will that vehicle stand?”—as its point of departure, it says “that vehicle will not stand anywhere.”

source: རབ་འབྱོར་ཐེག་པ་དེ་ནི་གང་དུ་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་ནམ་མཁའ་གང་ན་ཡང་མི་གནས་པ་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་ཡང་མཐར་ཕྱིན་ཅིང་ཆོས་ཀྱི་སྐུའི་བདག་ཉིད་ཡིན་པས་གང་དུ་ཡང་གནས་པར་མི་འགྱུར་རོ།
en: Just as space does not stand anywhere, similarly the Great Vehicle, reaching the end in the form of the dharma body, does not stand anywhere either.

source: །ཐེག་པ་ཆེན་པོ་འབའ་ཞིག་གནས་པར་མི་འགྱུར་བར་མ་ཟད་ཀྱི། ཀུན་བརྟགས་པ་དང་། ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཐམས་ཅད་ཀྱང་གང་ན་ཡང་མི་གནས་སོ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: This is teaching not just that the Great Vehicle does not stand, but that all falsely imagined and thoroughly established dharmas do not stand anywhere either. “

source: །ཆོས་ཐམས་ཅད་གནས་པ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ལ། ཀུན་བརྟགས་པ་ནི་མེད་པའི་ཕྱིར་གང་ན་ཡང་མི་གནས་སོ།
en: Because no dharma stands”— a falsely imagined phenomenon does not exist, so it does not stand anywhere.

source: །ཡོངས་སུ་གྲུབ་པ་ནི་གཞི་དང་བརྟེན་པ་མེད་པའི་ཕྱིར་གང་ན་ཡང་མི་གནས་སོ།
en: As for the thoroughly established phenomenon, it does not stand anywhere because a basis and that which is based on that do not exist. “

source: །འོན་ཀྱང་ཐེག་པ་ཆེན་པོ་དེ་ནི་མི་གནས་པའི་ཚུལ་གྱིས་གནས་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་གནས་པ་མེད་པ་ཉིད་དེའི་གནས་པ་ཡིན་པར་ཐ་སྙད་གདགས་པར་བསྟན་པའོ།
en: And yet, Subhūti, that vehicle will stand by way of not standing” teaches that just “not standing” is conventionally labeled its “stand.”

source: །དེ་བས་ན་དེ་བཞིན་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says “suchness does not stand or not stand.”

source: དོན་དམ་པར་བརྟེན་པའི་མཚན་ཉིད་མེད་པའི་ཕྱིར་གནས་པ་ཡང་མ་ཡིན་ནོ། །མི་གནས་པའི་མཚན་ཉིད་དུ་གནས་པའི་ཕྱིར་ཐ་སྙད་དུ་མི་གནས་པ་ཡང་མ་ཡིན་ནོ།
en: It “does not stand” because ultimately it does not have the mark of that which is based on something; and it “does not not stand” either, because conventionally it stands marked by not standing.

source: །དེ་བཞིན་དུ་གནས་པ་དང་། མི་གནས་པའི་མཚན་ཉིད་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: Similarly, connect the marks of standing and not standing with them all. “

source: །མི་གནས་པར་གནས་པའི་ཚུལ་དང་།
en: That vehicle, standing by way of not standing and by way of not moving, will not stand anywhere.”

source: བསྐྱོད་དུ་མེད་པའི་ཚུལ་གྱིས་གང་དུ་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ་ཞེས་བྱ་བ་ནི་རྟེན་གྱི་དངོས་པོར་གང་དུ་ཡང་གནས་པར་འགྱུར་བ་མེད་དེ། དེ་བས་ན་མི་གནས་པ་ཞེས་བྱའོ། །མི་གནས་པའི་མཚན་ཉིད་ཀྱིས་གནས་པ་དང་། བརྟན་པ་དང་། ཕྱིན་ཅི་ལོག་མེད་པའི་ཕྱིར་གནས་པ་ཞེས་བྱའོ།
en: It does not stand anywhere as a real basis so it says “not standing”; and it stands with the mark of not standing, is that which is based on something, and is without error, so it says “standing.”

source: །དེས་སུ་ཞིག་ངེས་པར་འབྱུང་བར་འགྱུར་ཞེས་བྱ་བ་ནི་ཞུས་པ་ལྔ་པ་སྟེ།
en: 10. Who will go forth in this vehicle? The fifth question is, “Who will go forth in” that?

source: ཐེག་པ་དེ་གང་ཡིན་པ་དང་ཞེས་བྱ་བ་ནི་ཐེག་པ་ཆེན་པོའོ།
en: That vehicle is “the Great Vehicle.” “

source: །གང་ངེས་པར་འབྱུང་བར་འགྱུར་བ་ཞེས་བྱ་བ་ནི་གང་ཟག་གོ། །གང་གིས་ངེས་པར་འབྱུང་བར་འགྱུར་ཞེས་བྱ་བ་ནི་ལམ་གྱི་ཆོས་གང་གིས་ཞེས་བྱ་བ་སྟེ། རྒྱུ་གང་གིས་ངེས་པར་འབྱུང་བར་འགྱུར་བའོ། །གང་ནས་ངེས་པར་འབྱུང་བར་འགྱུར་བ་ཞེས་བྱ་བ་ནི་སྲིད་པ་ལས་སོ།
en: One who goes forth” is the person; “by which one goes forth” is the path dharmas “by which”—the cause on account of which—one goes forth; and “from where one goes forth” is from suffering existence. “

source: །ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་བདག་མི་དམིགས་སོ་ཞེས་བྱ་བ་ནི་གལ་ཏེ་བདག་ལ་སོགས་པ་དང་། གཟུགས་ལ་སོགས་པ་ཡོངས་སུ་ཟིན་ན། ཡོངས་སུ་གྲུབ་པ་ཤིན་ཏུ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ཉམས་པར་འགྱུར་རོ་ཞེས་སྟོན་ཏོ།
en: You cannot apprehend a self because it is extremely pure” teaches that if they grasp a “self” and so on, and form and so on, it spoils the thoroughly established phenomenon that is absolutely pure. “

source: །བཅོམ་ལྡན་འདས་གང་མི་དམིགས་པས་ཆོས་འདི་དག་ཐམས་ཅད་དམིགས་སུ་མ་མཆིས་པ་ལགས་ཞེས་བྱ་བ་ནི་མི་དམིགས་པ་སྔར་སྨོས་པ་ཐམས་ཅད་ཀྱི་གཏན་ཚིགས་ཞུས་པའོ།
en: Lord, what do you not apprehend such that all these dharmas are not apprehended?” This is a question about the reason why all that has been said before cannot be apprehended.

source: །དེ་ལ་འགྲེས་གསུམ་སྟེ།
en: It has three connected sections.

source: ཐོག་མར་དེ་བཞིན་ཉིད་ལ་སོགས་པ་མི་དམིགས་པ་ནི་ཆོས་དེ་དག་དམིགས་སུ་མེད་པའི་གཏན་ཚིགས་ཀྱི་འགྲེས་དང་པོའོ།
en: The first connected section, “not apprehending suchness” and so on, is the reason those dharmas cannot be apprehended.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་ཉིད་ལ་སོགས་པ་ཅིའི་ཕྱིར་མི་དམིགས་སྙམ་དུ་ཐེ་ཚོམ་དུ་གྱུར་པ་དང་།
en: Then the second connected section is the qualm, “And why” is suchness and so on not apprehended?

source: དེ་བཞིན་ཉིད་ལ་སོགས་པ་དེ་དག་གི་རང་གི་མཚན་ཉིད་མི་དམིགས་པས། དམིགས་སུ་མེད་དོ་ཞེས་བྱ་བ་ནི་འགྲེས་གཉིས་པའོ།
en: And where it says “because of not apprehending” the defining mark of those, of “suchness” and so on, they are “not apprehended.”

source: །དེ་ནས་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། ས་ལ་སོགས་པའི་ཆོས་རྣམས་མི་དམིགས་པ་ཞེས་བྱ་བ་ནི་འགྲེས་གསུམ་པའོ།
en: Then in the third connected section all the emptinesses, and the dharmas—the levels and so on—are “not apprehended.”

source: །དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་ཞེས་བྱ་བ་ནི་ལྷག་མཐོང་གི་གནས་སྐབས་འབའ་ཞིག་ལ་བྱ་སྟེ། མོས་པ་སྤྱོད་པའི་ས་ལའོ།
en: Refer “the Śuklavipaśyanā level” only to the period of special insight on the devoted course of conduct level. “

source: །རིགས་ཀྱི་ས་ཞེས་བྱ་བ་ནི་རིགས་ཀྱི་གནས་སྐབས་ལ་ས་ཞེས་བྱ་སྟེ། རིགས་ཀྱི་ས་ཞེས་བྱ་བ་ནི་ངེས་པར་འབྱེད་པའི་ཆ་དང་མཐུན་པའི་དགེ་བའི་རྩ་བའི་གནས་སྐབས་མ་ལུས་པར་བསྟན་ཏོ།
en: Gotra level” indicates all the periods of the wholesome roots that are aids to knowledge that penetrates reality.

source: །བཅོམ་ལྡན་འདས་ཐེག་པ་ཆེན་པོ་ཞེས་བགྱི་བ་འདི་ནི་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོ་ནི་སྔར་བཤད་ཟིན་པ་སྙམ་ན་སྐབས་གང་ཡིན་ཞེ་ན།
en: 11. It surpasses the world with its gods, humans, and asuras and goes forth. Is that why it is called a great vehicle? You may think: the Great Vehicle, where it says, “Lord, you say this—‘Great Vehicle,’ ” has already been explained before, so what is the context here?

source: དེ་ཡང་བདེན་མོད་ཀྱི། སྔར་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་སྒྲ་བཤད་པ་ལས། འཇུག་པའི་སྐབས་སུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་གཟུངས་ཀྱི་སྒོའི་མཐའ་ལ་ཐུག་གི་བར་དུ་སྒྲུབ་པའི་ཆོས་རྣམས་ཐེག་པ་ཆེན་པོ་ཡིན་པར་བསྟན་ཏོ།
en: In response, we say that is true, but earlier the explanation of the words was in the context of those who “have set out in the Great Vehicle,” teaching that the practice dharmas in the context of setting out, from the perfections and so on up to the dhāraṇī doors, are the Great Vehicle.

source: །ད་ནི་ཐེག་པ་དེ་གང་ནས་ངེས་པར་འབྱུང་བར་འགྱུར་ཞེས་བྱ་བ་ལ་སོགས་པ་ངེས་པར་འབྱུང་བའི་གནས་སྐབས་ནས་འབྲས་བུའི་ཐེག་པ་ཆེན་པོ་སངས་རྒྱས་ཉིད་དུ་བསྟན་ཏོ།
en: Now, where it says “from where that vehicle goes forth” and so on, in the part of the text about going forth, it is giving an exposition of the resultant Great Vehicle as the state of a buddha.

source: །དེ་བས་ན་ད་ནི་འབྲས་བུའི་ཐེག་པ་ཆེན་པོ་འདི་ལ། ཐེག་པ་ཆེན་པོའི་ངེས་པའི་ཚིག་དང་། ཐེག་པ་ཆེན་པོའི་ཆོས་རྣམས་ཡང་བསྟན་པར་བྱ་སྟེ།
en: So now, for this resultant Great Vehicle, an exposition has to be given of the creative explanation of Great Vehicle and of the Great Vehicle dharmas.

source: འདི་ནི་གནས་སྐབས་སོ།
en: That is the context. “

source: །ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ནས་ངེས་པར་འབྱུང་བར་འགྱུར་ཏེ། དེའི་སླད་དུ་ཐེག་པ་ཆེན་པོ་ཞེས་བགྱིའོ་ཞེས་བྱ་བ་ལ།
en: It surpasses the world with its gods, humans, and asuras and goes forth; that is why it is called a great vehicle.”

source: འགྲོ་བ་ནི་འདིར་ཐེག་པ་ཆེན་པོ་ཞེས་བྱའོ།
en: Here a going is called a vehicle.

source: །ངེས་པར་འབྱུང་བ་ཆེ་བ་གང་ཡིན་པ་དེ་ཐེག་པ་ཆེན་པོའོ།
en: The great going forth is the Great Vehicle.

source: །གང་གི་ཕྱིར་འཇིག་རྟེན་གསུམ་པོ་ཟིལ་གྱིས་མནན་ཏེ་ཐམས་ཅད་ལས་ངེས་པར་འབྱུང་བ་དེའི་ཕྱིར། འདིའི་ངེས་པར་འབྱུང་བ་ཆེ་བས་ཐེག་པ་ཆེན་པོ་ཞེས་བྱའོ།
en: Because it surpasses the three worlds and is a definite emergence from them all, that going forth is bigger, hence it is called a great vehicle. 12.

source: །ཐེག་པ་ཆེན་པོ་དེ་ནི་ནམ་མཁའ་དང་མཉམ་པ་སྟེ་ཞེས་བྱ་བས་ནི་དེ་ཉིད་ཀྱི་ཆེ་བ་ཉིད་སྒྲུབ་སྟེ་སྐབས་འབྱེད་པ་ཆེ་བ་དང་།
en: That vehicle is equal to space “That Great Vehicle is equal to space” establishes the greatness of true reality.

source: སྐྱེ་བ་དང་། འགག་པ་ལ་སོགས་པ་མེད་པ་དང་། དུས་ཀྱིས་མ་བསྡུས་པ་དང་རྒྱུ་རྣམ་པ་གསུམ་གྱིས་ནམ་མཁའ་དང་འདྲ་བར་བསྟན་ཏོ།
en: Because of a threefold reason it is taught to be equal to space: it has a great amount of room;its production, stopping, and so on do not exist; and it is not included in the three times. “

source: །དཔེར་ན་ནམ་མཁའ་ལ་སེམས་ཅན་ཐམས་ཅད་སྐད་ཅིག་གཅིག་ལ་ཇི་ལྟར་འདོད་པའི་སྤྱོད་ལམ་ཐམས་ཅད་ཀྱིས་གནས་ཀྱང་དོགས་པ་མེད་པས་གོ་སྐབས་ཕྱེ་བ་དེ་བཞིན་དུ། ཐེག་པ་ཆེན་པོ་འདི་ལ་ཡང་སྐད་ཅིག་གཅིག་ལ་སེམས་ཅན་ཐམས་ཅད་ཅིག་ཅར་ལྷགས་ནས་ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་འཁོད་ནས་གནས་ཀྱང་གོ་སྐབས་ཡངས་པའི་ཕྱིར་གནོད་པ་ཅི་ཡང་མེད་དོ།
en: To illustrate, just as space” definitely, in a single instant, “has room”— places for all kinds of behavior all “beings” want to engage in—similarly, in this “Great Vehicle,” in a single instant all beings come together at the same time, without any problem at all, even though they are established in the places for all-knowledge, for the knowledge of path aspects, and for the knowledge of all aspects. “

source: །དཔེར་ན་ནམ་མཁའ་ནི་དུས་འདི་ལ་འོངས་སོ་བྱུང་ངོ་ཞེས་བྱ་བའམ། སོང་ངོ་འགགས་སོ་ཞེས་བྱ་བ་འམ། གནས་པའི་སྐད་ཅིག་གི་དབང་གིས་གནས་སོ་ཞེས་བྱ་བར་བརྗོད་དུ་མི་རུང་སྟེ། ཐེག་པ་ཆེན་པོ་ཡང་དེ་བཞིན་ནོ།
en: To illustrate,” it is not suitable to say of “space” at the time that it was “coming,” “originated,” or was “going,” “stopped,” or was “remaining,” based on “remaining for a moment”—so too for “the Great Vehicle.” “

source: །དཔེར་ན་ནམ་མཁའ་ནི་སྔོན་གྱི་དུས་དེ་ན་བྱུང་ངོ་། །ཕྱི་མའི་དུས་དེ་ན་འབྱུང་བར་འགྱུར་རོ། །བར་གྱི་དུས་དེ་ན་ཡོད་དོ་ཞེས་བརྗོད་པར་མི་ནུས་ཏེ། ཐེག་པ་ཆེན་པོ་ཡང་དེ་བཞིན་ནོ་ཞེས་དེའི་རིམ་གྱིས་འགྲེས་གསུམ་གྱིས་བསྟན་ཏོ།
en: To illustrate,” you cannot say ‘space happened at that earlier time, will happen at that future time, or exists in the time in between’—so too for “the Great Vehicle.”

source: །དེ་ནས་གནས་བརྟན་གྱིས་སྨྲས་པའི་འགྲེས་ཉིད་ལ།
en: They are taught in that sequence in three connected sections.

source: བཅོམ་ལྡན་འདས་ཀྱིས་མངོན་པར་དགྱེས་པར་མཛད་ནས་སྔར་བཤད་པའི་རིམ་གྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པའི་ཆོས་རྣམས་རྣམ་པར་སྨིན་པའི་བདག་ཉིད་དུ་གྱུར་པ་ཆོས་ཀྱི་སྐུས་བསྡུས་པ་དང་། ཐེག་པ་ཆེན་པོ་ཉིད་དུ་བསྟན་ཏོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སོགས་པས་དེ་ལྟར་ཐེག་པ་ཆེན་པོ་བསྟན་ནས་དེའི་འོག་ཏུ་གནས་བརྟན་གྱིས་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ནས། ཐེག་པ་དེ་ངེས་པར་འབྱུང་བར་འགྱུར་ཏེ་ཞེས་བྱ་བ་དང་། ཐེག་པ་དེ་ནམ་མཁའ་དང་མཉམ་པ་སྟེ་ཞེས་བྱ་བ་དང་། བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ནི་སེམས་ཅན་གྲངས་མ་མཆིས་ཚད་མ་མཆིས། དཔག་ཏུ་མ་མཆིས་པ་རྣམས་ཀྱི་གོ་འབྱེད་དོ་ཞེས་བྱ་བ་དང་། འོང་བའམ། འགྲོ་བ་མི་དམིགས་ཞེས་བྱ་བ་དང་། སྔོན་གྱི་མཐའ་འམ།
en: Then the Lord, having delighted in that section spoken by the elder, explains, in the order of the prior passage, that the six perfections and so on included in the dharma body constituted out of the maturation dharmas are the Great Vehicle.

source: ཕྱི་མའི་མཐའ་མི་དམིགས་ཞེས་བྱ་བ་ཚིག་ལྔ་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས། རབ་འབྱོར་གང་ཡང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་ཐེག་པ་དེ་ནི་ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ནས་ངེས་པར་འབྱུང་བར་འགྱུར་ཞེས་སྨྲས་པ་ནི་ཞེས་བྱ་བ་ལ་སོགས་པས་ཚིག་དེ་དག་སོ་སོར་སྨོས་ཏེ། དེ་དག་རྒྱ་ཆེར་བསྟན་ཏོ།
en: Having thus taught the Great Vehicle as the six perfections and so on, then, in reference to the five statements of the elder, that “it surpasses the world with its gods, humans, and asuras and goes forth; … that vehicle is equal to space… to illustrate, Lord, just as space has room for infinite, countless beings beyond measure, … you cannot apprehend coming or going… [and] you cannot apprehend a prior limit or a later limit,” the Lord says what he said, with “Furthermore, Subhūti, where you have said, ‘This vehicle surpasses the world with its gods, humans, and asuras and goes forth,’ ” and so on, and gives a detailed exposition of each.

source: །རབ་འབྱོར་གལ་ཏེ་འདོད་པའི་ཁམས་དེ་བཞིན་དུ་གྱུར་ཏེ། མ་ནོར་བ་དང་ཞེས་བྱ་བ་ལ་སོགས་པས་ཇི་སྐད་བསྟན་པར་འགྱུར་ཞེ་ན།
en: What does it teach, where it says “Subhūti, if the desire realm were to be factual, unmistaken,” and so on?

source: གལ་ཏེ་འདོད་པའི་ཁམས་ལ་སོགས་པ་ཆོས་ཐམས་ཅད་ཀུན་བརྟགས་པ་དང་ཡང་དག་པ་མ་ཡིན་པ་མ་ཡིན་ཏེ། ཡོངས་སུ་གྲུབ་པ་དེ་ཁོ་ན་ཉིད་ཀྱི་ངོ་བོ་ཞིག་ཡིན་དུ་ཟིན་ན་ཐེག་པ་ཆེན་པོ་འདི་དེ་དག་ལས་ངེས་པར་འབྱུང་བར་མི་འགྱུར་ཞིང་།
en: It is teaching that if all dharmas—the form realm and so on—are taken to be not falsely imagined and not unreal, were they taken to be thoroughly established, truly real entities, then this Great Vehicle would not go forth from them, and would not abandon them.

source: དེ་དག་ཡོངས་སུ་སྤོང་བར་མི་འགྱུར་བ་ཞིག་ན་འདི་ལྟར་ཆོས་དེ་དག་ཐམས་ཅད་ཀུན་བརྟགས་པ་སྟེ། ཡང་དག་པ་མ་ཡིན་པས། དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདི་དེ་དག་ཡོངས་སུ་སྤོང་བར་འགྱུར་རོ་ཞེས་བསྟན་པ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་འདོད་པའི་ཁམས་དེ་བཞིན་དུ་གྱུར་ཏེ།
en: But all those dharmas are falsely imagined, are unreal, and thus this Great Vehicle does abandon them.

source: མ་ནོར་བ་དང་། གཞན་མ་ཡིན་པ་དང་། ཕྱིན་ཅི་མ་ལོག་པ་དང་། དེ་ཁོ་ན་དང་། ཡང་དག་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་གལ་ཏེ་འདོད་པའི་ཁམས་དངོས་པོ་ཡོད་པར་གྱུར་ཏེ་དངོས་པོ་མེད་པ་མ་ཡིན་ན་ཞེས་བྱ་བར་སྦྱར་ཏེ།
en: Construe “Subhūti, if the desire realm were to be factual, unmistaken, unaltered, not an error, reality, the real,” and so on—with: if the desire realm “were to be existent, not nonexistent.”

source: གལ་ཏེ་འདོད་པའི་ཁམས་ཡོད་པར་གྱུར་ཏེ་མེད་པ་མ་ཡིན་ན་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་དང་། བདེན་པའི་མཚན་ཉིད་དང་། འདུས་མ་བྱས་ཀྱི་མཚན་ཉིད་དང་། རྣམ་པ་གསུམ་གྱིས་ཡོད་པ་ཉིད་དུ་འགྱུར་ཏེ། དེ་ལ་དེ་བཞིན་དུ་གྱུར་པ་དང་། མ་ནོར་བ་དང་། གཞན་མ་ཡིན་པ་ཞེས་བྱ་བ་ཚིག་གསུམ་གྱིས་ནི་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་བསྟན་ཏོ།
en: If the desire realm “were to be,” that is to say, were it “not nonexistent,” it would exist with the threefold mark of a thoroughly established phenomenon, a true phenomenon, and an uncompounded phenomenon.

source: །ཕྱིན་ཅི་མ་ལོག་པ་དང་། དེ་ཁོ་ན་དང་། ཡང་དག་པ་དང་། བདེན་པ་དང་། ཇི་ལྟ་བ་བཞིན་དུ་ཞེས་བྱ་བ་ཚིག་ལྔས་ནི་བདེན་པ་བསྟན་ཏོ། །རྟག་པ་དང་།
en: There, the three terms, “factual, unmistaken, and unaltered,” teach the mark of the thoroughly established; the five terms, “not an error, reality, the real,” and “true, as things are,” teach a true phenomenon; and the four terms, “permanent, stable, eternal, qualified by not changing,” teach the mark of the uncompounded.

source: བརྟན་པ་དང་། ཐེར་ཟུག་དང་། མི་འགྱུར་བའི་ཆོས་ཅན་ཞེས་བྱ་བ་ཚིག་བཞིས་ནི་འདུས་མ་བྱས་ཀྱི་མཚན་ཉིད་བསྟན་ཏོ། །དེ་ལ་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་ནི་རྣམ་པ་གསུམ་སྟེ། མི་འཇིགས་པར་ཡོངས་སུ་གྲུབ་པ་དང་།
en: There, the mark of the thoroughly established is threefold: the thoroughly established that is indestructible, the thoroughly established without error, and the thoroughly established that does not alter. “

source: ཕྱིན་ཅི་མ་ལོག་པར་ཡོངས་སུ་གྲུབ་པ་དང་། མི་འགྱུར་བར་ཡོངས་སུ་གྲུབ་པའོ། །དེ་ལ་དེ་བཞིན་དུ་གྱུར་ཞེས་བྱ་བས་ནི་མི་འཇིགས་པར་ཡོངས་སུ་གྲུབ་པ་བསྟན་ཏོ། །མ་ནོར་ཞེས་བྱ་བས་ནི་ཕྱིན་ཅི་མ་ལོག་པར་ཡོངས་སུ་གྲུབ་པ་བསྟན་ཏོ། །གཞན་མ་ཡིན་ཞེས་བྱ་བས་ནི་མི་འགྱུར་བར་ཡོངས་སུ་གྲུབ་པ་བསྟན་ཏོ།
en: Factual” teaches the thoroughly established that is indestructible, “unmistaken” teaches the thoroughly established without error, and “unaltered” teaches the thoroughly established that does not alter.

source: །བདེན་པའི་མཚན་ཉིད་ཀྱང་རྣམ་པ་ལྔ་སྟེ།
en: The mark of a true phenomenon is also fivefold.

source: ཕྱིན་ཅི་མ་ལོག་པའི་མཚན་ཉིད་ནི་དཔེར་ན་སྨིག་རྒྱུ་ལ་ཆུར་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་མེད་པ་ལྟ་བུ་སྟེ།
en: The not-an-error mark is, for example, like the nonexistence of being in error about water in a mirage. “

source: དེ་ནི་ཕྱིན་ཅི་མ་ལོག་པ་ཞེས་བྱ་བས་བསྟན་ཏོ།
en: Not an error” teaches that.

source: །ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་ནི་དཔེར་ན་སྒྱུ་མ་ལ་ངོ་བོ་ཉིད་མེད་པའི་དངོས་པོ་ལྟ་བུ་སྟེ། དེ་ནི་དེ་ཁོ་ན་ཞེས་བྱ་བས་བསྟན་ཏོ།
en: The mark of an intrinsic nature is, for example, like the real thing that is the nonexistence of an intrinsic nature in a magically produced illusion. “Reality” teaches that.

source: །ཡོད་པའི་མཚན་ཉིད་ནི་དཔེར་ན་སྐྲ་ཤད་འཛིངས་པ་ལ་སོགས་པ་ལ་ཡོད་པ་མ་ཡིན་པའི་མཚན་ཉིད་དུ་གྱུར་པ་མེད་པ་ལྟ་བུ་སྟེ།
en: The mark of existence is, for example, like the nonexistence of being marked as not existing in matted falling hairs, and so on. “

source: དེ་ནི་ཡང་དག་པ་ཞེས་བྱ་བས་བསྟན་ཏོ། །མི་སླུ་བའི་མཚན་ཉིད་ནི་དཔེར་ན་ཟླ་བ་གཉིས་སུ་གྱུར་པ་ལ་སོགས་པར་འཁྲུལ་པའི་མཚན་ཉིད་མེད་པ་ལྟ་བུ་སྟེ།
en: The real” teaches that. The mark of the nondeceptive is, for example, like the nonexistence of the deceiving mark in the form of two moons and so on. “

source: དེ་ནི་བདེན་པ་ཞེས་བྱ་བས་བསྟན་ཏོ།
en: True” teaches that.

source: །རིགས་པའི་མཚན་ཉིད་ནི་དཔེར་ན་རྟག་པ་དང་། བདེ་བ་དང་། བདག་ལ་སོགས་པ་འཐད་པ་དང་བྲལ་བར་གྱུར་པ་མེད་པ་ལྟ་བུ་སྟེ།
en: The mark of being correct is, for example, like the nonexistence of “permanent,” “happy,” “self” and so on being separated from being feasible. “

source: དེ་ནི་ཇི་ལྟ་བ་བཞིན་ཞེས་བྱ་བས་བསྟན་ཏོ།
en: As things are” teaches that.

source: །འདུས་མ་བྱས་ཀྱི་མཚན་ཉིད་ནི་རྣམ་པ་བཞི་སྟེ། སྐྱེ་བ་དང་། འགག་པ་མེད་པའི་མཚན་ཉིད་ནི་འདི་ལྟ་སྟེ། རྟག་པ་ཞེས་གསུངས་པའོ།
en: The mark of the uncompounded is fourfold.

source: །རྟག་ཏུ་གནས་པའི་མཚན་ཉིད་ནི་འདི་ལྟ་སྟེ། བརྟན་པ་ཞེས་གསུངས་པའོ། །འཆད་པ་མེད་པའི་མཚན་ཉིད་ནི་འདི་ལྟ་སྟེ། ཐེར་ཟུག་ཅེས་གསུངས་པའོ། །འགྱུར་བ་མེད་པའི་མཚན་ཉིད་ནི་འདི་ལྟ་སྟེ། མི་འགྱུར་བའི་ཆོས་ཅན་ཞེས་གསུངས་པའོ།
en: About the mark of not being produced and not stopping it says “permanent”; about the mark of remaining constantly it says “stable”; about the mark of not being annihilated it says “eternal”; and about the mark of not changing it says “qualified by not changing.”

source: །རབ་འབྱོར་དེའི་ཕྱིར་འདོད་པའི་ཁམས་ནི་ཀུན་བརྟགས་པ། རྣམ་པར་བསྒྲུབ་པ་ཚིག་གིས་བསྟན་པ་ཞེས་བྱ་བ་ལ། བརྟགས་པ་ཞེས་བྱ་བ་ནི་བདེན་པ་མ་ཡིན་པའི་ཕྱིར་ཀུན་བརྟགས་པ་མ་ཡིན་པ་ཉིད་དུ་བསྟན་ཏོ། །རྣམ་པར་བསྒྲུབས་པ་ཞེས་བྱ་བ་ནི་གཞན་གྱི་དབང་གིས་བཀོད་པའི་ཕྱིར་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་བརྟགས་པ་ཉིད་དུ་བསྟན་ཏོ། །ཚིག་གིས་བསྟན་པ་ཞེས་བྱ་བས་ནི་ཀུན་རྫོབ་ཡིན་པའི་ཕྱིར་བརྗོད་པར་བྱ་བ་ཉིད་དུ་བསྟན་ཏོ།
en: In “Subhūti, it is because the desire realm is all a construction, a creation, a narrative,” “a construction” teaches that it is not falsely imagined because constructed means not true; “a creation” teaches that because it is dependently established it is just the falsely imagined unreal; and “a narrative” teaches that because it is conventional it is just something to be said. “

source: །དངོས་པོ་མེད་པ་སྟེ། དངོས་པོ་ཡོད་པ་མ་ཡིན་པ་ཞེས་བྱ་བ་ནི་མེད་པ་སྟེ་ཡོད་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་གསུམ་སྟེ།
en: Not existent, and nonexistent” means it is nonexistent, it does not exist; “the world with its gods, humans, and asuras” is the three worlds.

source: ལྷ་མ་ཡིན་སྨོས་པས་ནི་འོག་གི་འཇིག་རྟེན་བསྟན་ཏོ། །མི་སྨོས་པས་ནི་བར་གྱི་འཇིག་རྟེན་བསྟན་ཏོ། །ལྷ་སྨོས་པས་ནི་གོང་མའི་འཇིག་རྟེན་བསྟན་ཏོ། །འགྲེས་འདི་ལ་ཡང་ཁམས་གསུམ་པོ་དག་དང་། ཕུང་པོ་རྣམས་དང་། སྐྱེ་མཆེད་རྣམས་དང་།
en: The locution “asuras” indicates the world below, “humans” indicates the world in between, and “gods” indicates the world above.

source: རྣམ་པར་ཤེས་པའི་ཚོགས་དྲུག་དང་། འདུས་ཏེ་རེག་པའི་ཚོགས་དྲུག་དང་། ཚོར་བའི་ཚོགས་དྲུག་དང་། ཁམས་དྲུག་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡན་ལག་བཅུ་གཉིས་པ་དང་། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པའི་དེ་བཞིན་ཉིད་དང་། ཆོས་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་གནས་པ་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ལ་སོགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་མཐའ་ལ་ཐུག་པ་རྣམས་དང་། རིགས་ཀྱི་སའི་ཆོས་ལ་སོགས་པས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་མཐའ་ལ་ཐུག་པ་རྣམས་དང་། རིགས་ཉིད་ལ་སོགས་པ་སངས་རྒྱས་ཀྱི་མཐའ་ལ་ཐུག་པ་རྣམས་དང་། སེམས་བསྐྱེད་པ་ཐམས་ཅད་དང་། རྡོ་རྗེ་ལྟ་བུའི་ཡེ་ཤེས་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་རྣམས་དང་། འོད་དང་། ཡན་ལག་དྲུག་ཅུ་དང་ལྡན་པའི་དབྱངས་དང་། ཆོས་ཀྱི་འཁོར་ལོ་དང་། སེམས་ཅན་རྣམས་དང་། འདི་དག་བསྟན་ཏོ། །དེ་ལ་ཡན་ལག་དྲུག་ཅུ་དང་ལྡན་པའི་དབྱངས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པའི་གསང་བའི་མདོ་ལས། ཇི་སྐད་དུ་ཞི་བའི་བློ་གྲོས་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་ཡན་ལག་རྣམ་པ་དྲུག་ཅུ་དང་ལྡན་པ་འབྱུང་སྟེ། མཉེན་པ་དང་། འཇམ་པ་དང་། ཡིད་དུ་འོང་བ་དང་། ཡིད་དུ་འཐད་པ་དང་། དག་པ་དང་། དྲི་མ་མེད་པ་དང་། གསལ་བ་དང་། སྙན་ཅིང་འཇེབས་པ་དང་། མཉན་པར་འོས་པ་དང་། མི་ཚུགས་པ་དང་། སྙན་པ་དང་། དུལ་བ་དང་། མི་རྩུབ་པ་དང་། མི་བརླང་བ་དང་། རབ་ཏུ་དུལ་བ་དང་། རྣར་སྙན་པ་དང་། ལུས་སིམ་པར་བྱེད་པ་དང་། སེམས་ཚིམ་པར་བྱེད་པ་དང་། སྙིང་དགའ་བར་བྱེད་པ་དང་། དགའ་བ་སྐྱེད་པ་དང་། ཡོངས་སུ་གདུང་བ་མེད་པ་དང་། ཀུན་ཤེས་པར་བྱེད་པ་དང་། རྣམ་པར་རིག་པར་བྱ་བ་དང་། རྣམ་པར་གསལ་བ་དང་། དགའ་བར་བྱེད་པ་དང་། མངོན་པར་དགའ་བར་བྱེད་པ་དང་། ཀུན་ཤེས་པར་བྱེད་པ་དང་། རྣམ་པར་རིག་པར་བྱེད་པ་དང་། རིགས་པ་དང་། འབྲེལ་པ་དང་། ཟློས་པའི་སྐྱོན་མེད་པ་དང་། སེང་གེའི་སྒྲའི་ཤུགས་དང་། གླང་པོ་ཆེའི་སྒྲ་སྐད་དང་། འབྲུག་གི་སྒྲ་དབྱངས་དང་། ཀླུའི་དབང་པོའི་སྒྲ་དང་། དྲི་ཟའི་གླུ་དབྱངས་དང་། བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས་བསྒྲགས་པ་དང་། ཚངས་པའི་སྒྲ་དབྱངས་བསྒྲགས་པ་དང་། ཤང་ཤང་ཏེའུའི་སྒྲ་དབྱངས་སུ་གྲགས་པ་དང་།
en: In this connected section, furthermore, it teaches the three realms, the aggregates, the sense fields, the six collections of consciousnesses, the six collections of contacts, the six collections of feelings, the six elements, and the twelve links of dependent origination; suchness, unmistaken suchness, and unaltered suchness; the true nature of dharmas, the dharma-constituent, the establishment of dharmas, the certification of dharmas, the very limit of reality, and the inconceivable element; the six perfections, all the emptinesses, the side of awakening and so on ending with the buddhadharmas; the dharmas of the Gotra level and so on ending with the dharmas of the Buddha level; the Gotra level itself and so on ending with the Buddha level; all the productions of the thought; and the vajra-like knowledge, a great person’s major marks, light, the voice with sixty special qualities, the wheel of the Dharma, and beings.
